system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

	xmin    -8;
	xmax     8;
	ymin    -8;
  ymax     8;
	zmin    -4;
	zmax     4;
  xcells  60;
  ycells  60;
  zcells  15;



vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)

    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (7 3 2 6)
        );
    }
    
    bottom
    {
        type patch;
        faces
        (
            (1 0 4 5)
        );
    }
    side1
    {
        type patch;
        faces
        (
           (7 6 5 4)
        );
    }
     side2
    {
        type patch;
        faces
        (
            (2 3 0 1)
 
        );
    }
    front
    {
        type  patch;
        faces
        (
            
            (6 2 1 5)
        );
    }
    back
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
);


// ************************************************************************* //
