system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    sphere
    {
        type triSurfaceMesh;
        file "sphere.stl";
    }

}

castellatedMeshControls
{
    minRefinementCells 12;
    nCellsBetweenLevels 3;
    allowFreeStandingZoneFaces true;



    refinementSurfaces
    {
        sphere
        {
            level (1 1);
            patchInfo { type noslip; }
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((2 2));
        }
    }

    locationInMesh (0.8 0.4 0.4);
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    explicitFeatureSnap    false;
    implicitFeatureSnap    true;
}

addLayersControls
{
    layers
    {
        "sphere.*"
        {
            nSurfaceLayers 4;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-4;
}

meshQualityControls
{}

writeFlags
(
    noRefinement
    // scalarLevels
    // layerSets
    // layerFields
);

mergeTolerance 1e-5;


// ************************************************************************* //
