0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField uniform (-0.001 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type freestreamVelocity;
        freestreamValue uniform (0 0 0); // 远场自由流的速度，示例中为 (10, 0, 0)
        value uniform (-0.001 0 0);
    }
    
    bottom
    {
        type freestreamVelocity;
        freestreamValue uniform (0 0 0); // 远场自由流的速度，示例中为 (10, 0, 0)
        value uniform (-0.001 0 0);


    }
    side1
    {
        type freestreamVelocity;
        freestreamValue uniform (0 0 0); // 远场自由流的速度，示例中为 (10, 0, 0)
        value uniform (-0.001 0 0);
    }
     side2
    {
        type freestreamVelocity;
        freestreamValue uniform (0 0 0); // 远场自由流的速度，示例中为 (10, 0, 0)
        value uniform (-0.001 0 0);

    }


    front
    {
    type            zeroGradient;

    }
    back
    {
    type            zeroGradient;
    }
    sphere
    {        
        type            movingWallVelocity;
        value           uniform (0 0 0);
    
    }
}


// ************************************************************************* //
