0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.15;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
 top
    {
    type            zeroGradient;


    }   
    bottom
    {
    type            zeroGradient;

    

    }
    side1
    {
    type            zeroGradient;

    
    }
     side2
    {
        type            zeroGradient;

    }
    front
    {
    type            zeroGradient;
    value           uniform 0;
    }
    back
    {
    type            zeroGradient;

     
    }
    sphere
    {
    type            epsilonWallFunction;
    value           uniform 0;
    }

    overset
    {
        type            overset;
    }
}


// ************************************************************************* //
