0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.3;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    sphere
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
  top
    {

        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;

    }   
    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    side1
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
     side2
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    back
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
     
    }
    overset
    {
        type            overset;
    }
}


// ************************************************************************* //
