0/motionScale
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointScalarField;
    location    "0";
    object      motionScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    top
    {
        type            calculated;
    }
    bottom
    {
        type            calculated;
    }
    side1
    {
        type            calculated;
    }
    side2
    {
        type            calculated;
    }
    front
    {
        type            calculated;
    }
    back
    {
        type            calculated;
    }
    sphere
    {
        type            calculated;
    }
}


// ************************************************************************* //
