0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    sphere
    {
    type            nutkWallFunction;
    value           uniform 0;
    }

  top
    {
        type            calculated;
        value           uniform 0;

    }   
    bottom
    {
        type            calculated;
        value           uniform 0;
    

    }
    side1
    {
        type            calculated;
        value           uniform 0;
    
    }
     side2
    {
        type            calculated;
        value           uniform 0; 
    }
    front
    {
        type            calculated;
        value           uniform 0;


    }
    back
    {
        type            calculated;
        value           uniform 0;
     
    }
    overset
    {
        type            overset;
    }
}


// ************************************************************************* //
