0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"
dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"
    
    sphere
    {
        type            omegaWallFunction;
        value           $internalField;
    }
  top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;

    }   
    bottom{
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    side1
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;

    
    }
     side2
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
 
    }
    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;

    }
    back
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
