0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{
    sphere
    {
        type  calculated;
    }
    top
    {
        type zeroGradient;


    }
    
    bottom
    {
        type zeroGradient;

    }
    side1
    {
        type zeroGradient;

    }
     side2
    {
        type zeroGradient;

    }
    front
    {
        type  zeroGradient;

    }
    back
    {
        type  zeroGradient;

    }

};


// ************************************************************************* //
