0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0];

internalField   uniform 1.225;


boundaryField
{
    top
    {
        type            fixedValue;
        value           uniform 1.225;

    }
    
    bottom
    {
        type            fixedValue;
        value           uniform 1.225;


    }
    side1
    {
        type            fixedValue;
        value           uniform 1.225;
    }
     side2
    {
        type            fixedValue;
        value           uniform 1.225;

    }
    front
    {
        type            fixedValue;
        value           uniform 1.225;

    }
    back
    {
        type            fixedValue;
        value           uniform 1.225;


    }
    sphere
    {
        type            fixedValue;
        value           uniform 1.225;
    }
}




// ************************************************************************* //
